app/Controllers/Admin/Pembayaran.php

SELECT `t_sewa`.*, `t_pelanggan`.`nama` as `nama_pelanggan`, `t_mobil`.`merk` as `mobil_merk`
FROM `t_sewa`
JOIN `t_pelanggan` ON `t_pelanggan`.`id_pelanggan` = `t_sewa`.`id_pelanggan`
JOIN `t_mobil` ON `t_mobil`.`id_mobil` = `t_sewa`.`id_mobil`
WHERE `t_sewa`.`status_pengajuan` = 'disetujui'
AND `t_sewa`.`status` != 'batal'
ORDER BY `t_sewa`.`tgl_sewa` DESC
---
    public function index()
    {
        $payments = $this->pembayaranModel->getAllPayments();
        $stats = $this->pembayaranModel->getStats();
        $pendingPayments = $this->pembayaranModel->getPendingPayments();

        // Ambil sewa yang sudah disetujui untuk dropdown
        $approvedRentals = $this->penyewaanModel
            ->select('t_sewa.*, t_pelanggan.nama as nama_pelanggan, t_mobil.merk as mobil_merk')
            ->join('t_pelanggan', 't_pelanggan.id_pelanggan = t_sewa.id_pelanggan')
            ->join('t_mobil', 't_mobil.id_mobil = t_sewa.id_mobil')
            ->where('t_sewa.status_pengajuan', 'disetujui')
            ->where('t_sewa.status !=', 'batal')
            ->orderBy('t_sewa.tgl_sewa', 'DESC')
            ->findAll();

SELECT *
FROM `t_sewa`
WHERE `t_sewa`.`id_sewa` = '7'
---
    public function process()
    {
        // Validasi input
        $rules = [
            'id_sewa'       => 'required|integer',
            'jumlah_bayar'  => 'required|string',
            'metode_bayar'  => 'required|in_list[tunai,transfer,ewallet]',
        ];

        // Conditional rules
        $metode = $this->request->getPost('metode_bayar');
        if ($metode === 'transfer') {
            $rules['jenis_bank'] = 'required';
        } elseif ($metode === 'ewallet') {
            $rules['jenis_ewallet'] = 'required';
        }

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $id_sewa = $this->request->getPost('id_sewa');
        $jumlah_bayar = (float)str_replace(['Rp', '.', ','], '', $this->request->getPost('jumlah_bayar'));
        $metode_bayar = $this->request->getPost('metode_bayar');
        $jenis_bank = $this->request->getPost('jenis_bank');
        $jenis_ewallet = $this->request->getPost('jenis_ewallet');

        // Cek total tagihan dan sisa bayar
        /** @var object|null $sewa */
        $sewa = $this->penyewaanModel->find($id_sewa);

INSERT INTO `t_pembayaran` (`id_sewa`, `tgl_bayar`, `jumlah_bayar`, `metode_bayar`, `status_bayar`, `jenis_bank`, `jenis_ewallet`) VALUES ('7', '2026-05-11 07:26:11', 90000, 'ewallet', 'lunas', NULL, 'DANA')
---
            'jenis_ewallet' => $metode_bayar == 'ewallet' ? $jenis_ewallet : null
        ];

        if ($this->pembayaranModel->save($data)) {