app/Models/PembayaranModel.php

SELECT `t_pembayaran`.*, `t_sewa`.`id_sewa` as `sewa_id`, `t_sewa`.`sub_total` as `total_tagihan`, `t_sewa`.`status_pengajuan`, `t_pelanggan`.`nama` as `nama_pelanggan`, `t_pelanggan`.`no_telp`, `t_mobil`.`merk` as `mobil_merk`
FROM `t_pembayaran`
JOIN `t_sewa` ON `t_sewa`.`id_sewa` = `t_pembayaran`.`id_sewa`
JOIN `t_pelanggan` ON `t_pelanggan`.`id_pelanggan` = `t_sewa`.`id_pelanggan`
JOIN `t_mobil` ON `t_mobil`.`id_mobil` = `t_sewa`.`id_mobil`
ORDER BY `t_pembayaran`.`tgl_bayar` DESC
---
    public function getAllPayments()
    {
        return $this->select('t_pembayaran.*,
                              t_sewa.id_sewa as sewa_id,
                              t_sewa.sub_total as total_tagihan,
                              t_sewa.status_pengajuan,
                              t_pelanggan.nama as nama_pelanggan,
                              t_pelanggan.no_telp,
                              t_mobil.merk as mobil_merk')
                    ->join('t_sewa', 't_sewa.id_sewa = t_pembayaran.id_sewa')
                    ->join('t_pelanggan', 't_pelanggan.id_pelanggan = t_sewa.id_pelanggan')
                    ->join('t_mobil', 't_mobil.id_mobil = t_sewa.id_mobil')
                    ->orderBy('t_pembayaran.tgl_bayar', 'DESC')
                    ->findAll();

SELECT `t_pembayaran`.*, `t_sewa`.`id_sewa` as `sewa_id`, `t_sewa`.`sub_total` as `total_tagihan`, `t_sewa`.`status_pengajuan`, `t_pelanggan`.`nama` as `nama_pelanggan`, `t_pelanggan`.`no_telp`, `t_pelanggan`.`email`, `t_mobil`.`merk` as `mobil_merk`, `t_mobil`.`plat_nomor`
FROM `t_pembayaran`
JOIN `t_sewa` ON `t_sewa`.`id_sewa` = `t_pembayaran`.`id_sewa`
JOIN `t_pelanggan` ON `t_pelanggan`.`id_pelanggan` = `t_sewa`.`id_pelanggan`
JOIN `t_mobil` ON `t_mobil`.`id_mobil` = `t_sewa`.`id_mobil`
WHERE `t_pembayaran`.`id_pembayaran` = '9'
 LIMIT 1
---
    public function getPaymentById($id)
    {
        return $this->select('t_pembayaran.*,
                              t_sewa.id_sewa as sewa_id,
                              t_sewa.sub_total as total_tagihan,
                              t_sewa.status_pengajuan,
                              t_pelanggan.nama as nama_pelanggan,
                              t_pelanggan.no_telp,
                              t_pelanggan.email,
                              t_mobil.merk as mobil_merk,
                              t_mobil.plat_nomor')
                    ->join('t_sewa', 't_sewa.id_sewa = t_pembayaran.id_sewa')
                    ->join('t_pelanggan', 't_pelanggan.id_pelanggan = t_sewa.id_pelanggan')
                    ->join('t_mobil', 't_mobil.id_mobil = t_sewa.id_mobil')
                    ->where('t_pembayaran.id_pembayaran', $id)
                    ->first();

SELECT SUM(`jumlah_bayar`) AS `jumlah_bayar`
FROM `t_pembayaran`
WHERE `id_sewa` = '7'
AND `status_bayar` IN ('lunas','sebagian')
---
    public function getTotalPaidBySewa($id_sewa)
    {
        return $this->selectSum('jumlah_bayar')
                    ->where('id_sewa', $id_sewa)
                    ->whereIn('status_bayar', ['lunas', 'sebagian'])
                    ->get()
                    ->getRow()
                    ->jumlah_bayar ?? 0;

SELECT `t_pembayaran`.*, `t_sewa`.`sub_total` as `total_tagihan`, `t_pelanggan`.`nama` as `nama_pelanggan`, `t_mobil`.`merk` as `mobil_merk`
FROM `t_pembayaran`
JOIN `t_sewa` ON `t_sewa`.`id_sewa` = `t_pembayaran`.`id_sewa`
JOIN `t_pelanggan` ON `t_pelanggan`.`id_pelanggan` = `t_sewa`.`id_pelanggan`
JOIN `t_mobil` ON `t_mobil`.`id_mobil` = `t_sewa`.`id_mobil`
WHERE `t_pembayaran`.`status_bayar` = 'belum'
ORDER BY `t_pembayaran`.`tgl_bayar` ASC
---
    public function getPendingPayments()
    {
        return $this->select('t_pembayaran.*,
                              t_sewa.sub_total as total_tagihan,
                              t_pelanggan.nama as nama_pelanggan,
                              t_mobil.merk as mobil_merk')
                    ->join('t_sewa', 't_sewa.id_sewa = t_pembayaran.id_sewa')
                    ->join('t_pelanggan', 't_pelanggan.id_pelanggan = t_sewa.id_pelanggan')
                    ->join('t_mobil', 't_mobil.id_mobil = t_sewa.id_mobil')
                    ->where('t_pembayaran.status_bayar', 'belum')
                    ->orderBy('t_pembayaran.tgl_bayar', 'ASC')
                    ->findAll();

SELECT SUM(`jumlah_bayar`) AS `jumlah_bayar`
FROM `t_pembayaran`
WHERE `status_bayar` = 'lunas'
SELECT COUNT(*) AS `numrows` FROM `t_pembayaran`
SELECT COUNT(*) AS `numrows`
FROM `t_pembayaran`
WHERE `status_bayar` = 'belum'
SELECT COUNT(*) AS `numrows`
FROM `t_pembayaran`
WHERE `status_bayar` = 'lunas'
---
    public function getStats()
    {
        $db = \Config\Database::connect();

        $totalPendapatan = $this->selectSum('jumlah_bayar')
                               ->where('status_bayar', 'lunas')
                               ->get()
                               ->getRow()
                               ->jumlah_bayar ?? 0;

        $totalTransaksi = $this->countAll();
        $pendingCount = $this->where('status_bayar', 'belum')->countAllResults();
        $lunasCount = $this->where('status_bayar', 'lunas')->countAllResults();